[
{
        "itemId": "567389220098",
        "img": "https://images-na.ssl-images-amazon.com/images/I/51zDRJv-nnL._SY355_.jpg",
        "title": "iPhone 6 cover case Limerense Img 1463 Jpg Spoken Articles",
        "description": "Quality pictures digitally printed onto the cover cases * Easy access to all buttons, controls and ports without removing the case * Choose your own personalised Phone case. It is also a good idea to keep it as a collection or to send it as a gift to your friends. * It is a real Case not a cheap sticker (skins) Dimensions",
        "category": "Mobile Phones",
        "country": "US",
        "condition": "New",
        "quantity": 100,
        "currentPrice": 14.98,
        "shipServiceCost": 0.0,
        "retrievedTime": 1502526449966
},
{
        "itemId": "567389265748",
        "img": "https://images-na.ssl-images-amazon.com/images/I/51dWYjPFIGL.jpg",
        "title": "IPHONE 7 32 GB BLACK",
        "description": "What's in the box: Certified Refurbished iPhone 6 Space Gray 16GB Unlocked , USB Cable/Adapter. Comes in a Generic Box with a 1 Year Limited Warranty.",
        "category": "Mobile Phones",
        "country": "US",
        "condition": "Used",
        "quantity": 25,
        "currentPrice": 349.55,
        "shipServiceCost": 10.0,
        "retrievedTime": 1502526449977
},
{
		"itemId": "344558393277",
        "img": "https://images-na.ssl-images-amazon.com/images/I/31OMCvbZ6cL.jpg",
        "title": "Atlas Shrugged Part III: Who is John Galt? [Blu-ray] (Steelbook Special Edition)",
        "description": "The Galt's Gulch Gold Blu-ray contains the FULL LENGTH Theatrical Release of Atlas Shrugged 3: Who is John Galt? which opened nationwide September 12th, 2014. ",
        "category": "Books",
        "country": "US",
        "condition": "New",
        "quantity": 20,
        "currentPrice": 50,
        "shipServiceCost": 5.55,
        "retrievedTime": 1502526449988
},
{
   		"itemId": "736338885544",
        "img": "https://images-na.ssl-images-amazon.com/images/I/81Nzs%2B-gJ3L.jpg",
        "title": "Collected Fictions",
        "description": "Although Jorge Luis Borges published his first book in 1923--doling out his own money for a limited edition of Fervor de Buenos Aires--he remained in Argentinian obscurity for almost three decades. In 1951, however, Ficciones appeared in French, followed soon after by an English translation. This collection, which included the cream of the author's short fictions, made it clear that Borges was a world-class (if highly unclassifiable) artist--a brilliant, lyrical miniaturist, who could pose the great questions of existence on the head of pin. And by 1961, when he shared the French Prix Formentor with Samuel Beckett, he seemed suddenly to tower over a half-dozen literary cultures, the very exemplar of modernism with a human face.",
        "category": "Books",
        "country": "US",
        "condition": "New",
        "quantity": 1,
        "currentPrice": 59.79,
        "shipServiceCost": 2.99,
        "retrievedTime": 1502526450000
}
]